Fix: readme corrections and v0.1.1 (#1)
* mcp fixes
readme fixes
tool attachment fixes
added streameable http transport
improved checkpointing
tool discovert fix for mcps
interrupt resolution tests
implemented aspnetcore sample
* version upgrade

---------

Authored-by: Alican K Crepin <alican.crepin@gmail.com>
